{
  "reviews": [
    {
      "reviewer": {"displayName": "Sarah Mitchell"},
      "starRating": "FIVE",
      "comment": "Ron was incredibly professional and arrived within 2 hours of my call. My AC stopped working in the middle of July and he had it running same day. Fair pricing too!",
      "createTime": "2024-07-15T14:30:00.000Z",
      "name": "review_001"
    },
    {
      "reviewer": {"displayName": "Michael Chen"},
      "starRating": "FOUR",
      "comment": "Good service overall. The technician was knowledgeable and fixed our heating system. Only complaint is it took 3 days to get an appointment during the busy season.",
      "createTime": "2024-01-22T10:15:00.000Z",
      "name": "review_002"
    },
    {
      "reviewer": {"displayName": "Patricia Johnson"},
      "starRating": "FIVE",
      "comment": "Excellent work on our furnace installation! Ron explained everything clearly and the crew was very respectful of our home. The price was reasonable and they finished ahead of schedule.",
      "createTime": "2023-11-08T16:45:00.000Z",
      "name": "review_003"
    },
    {
      "reviewer": {"displayName": "James Rodriguez"},
      "starRating": "THREE",
      "comment": "The repair work was fine but it took over a week to get a callback. Once they came out, the technician was professional and knew what he was doing. Just wish the response time was better.",
      "createTime": "2024-05-12T09:20:00.000Z",
      "name": "review_004"
    },
    {
      "reviewer": {"displayName": "Linda Williams"},
      "starRating": "FIVE",
      "comment": "Ron has been maintaining our HVAC system for 10 years. Always reliable, always fair pricing. When our AC died last summer he prioritized us and had it fixed the same day. Highly recommend!",
      "createTime": "2024-08-03T11:30:00.000Z",
      "name": "review_005"
    },
    {
      "reviewer": {"displayName": "David Thompson"},
      "starRating": "FOUR",
      "comment": "Great service and very knowledgeable. The technician explained the problem with our heating system and gave us options. A bit pricey but worth it for the quality of work.",
      "createTime": "2023-12-18T15:00:00.000Z",
      "name": "review_006"
    },
    {
      "reviewer": {"displayName": "Karen Anderson"},
      "starRating": "TWO",
      "comment": "Scheduled an appointment for AC maintenance but they were 4 hours late and didn't call to let me know. The work itself was okay but the scheduling issues were frustrating.",
      "createTime": "2024-06-25T17:45:00.000Z",
      "name": "review_007"
    },
    {
      "reviewer": {"displayName": "Robert Martinez"},
      "starRating": "FIVE",
      "comment": "Outstanding service! Emergency furnace repair in the middle of winter. Ron came out personally within hours and had us back up and running. Truly goes above and beyond for his customers.",
      "createTime": "2024-02-14T08:30:00.000Z",
      "name": "review_008"
    },
    {
      "reviewer": {"displayName": "Jennifer Lee"},
      "starRating": "FOUR",
      "comment": "Professional and courteous service. Our AC installation went smoothly. The only reason for 4 stars instead of 5 is the quote took a few days to receive. Otherwise, excellent work!",
      "createTime": "2024-05-30T13:20:00.000Z",
      "name": "review_009"
    },
    {
      "reviewer": {"displayName": "Thomas Garcia"},
      "starRating": "FIVE",
      "comment": "Ron is the best! Fixed our heating system quickly and explained everything in terms we could understand. Fair pricing and honest service. We won't use anyone else.",
      "createTime": "2023-10-15T10:00:00.000Z",
      "name": "review_010"
    },
    {
      "reviewer": {"displayName": "Mary Wilson"},
      "starRating": "FIVE",
      "comment": "Incredible response time during our AC emergency. Called at 9am and Ron was at our door by noon. Professional, efficient, and reasonably priced. Grateful for his service!",
      "createTime": "2024-07-22T14:15:00.000Z",
      "name": "review_011"
    },
    {
      "reviewer": {"displayName": "Christopher Moore"},
      "starRating": "THREE",
      "comment": "The repair work was done well but it took nearly 2 weeks to get scheduled. For non-emergency work I guess that's okay but we were hoping for faster service.",
      "createTime": "2024-04-08T16:30:00.000Z",
      "name": "review_012"
    },
    {
      "reviewer": {"displayName": "Elizabeth Taylor"},
      "starRating": "FIVE",
      "comment": "Ron installed our new HVAC system and it's been running perfectly for 2 years. His follow-up maintenance service is excellent. Trustworthy and professional - highly recommend!",
      "createTime": "2023-09-20T11:45:00.000Z",
      "name": "review_013"
    },
    {
      "reviewer": {"displayName": "Daniel Brown"},
      "starRating": "FOUR",
      "comment": "Very satisfied with the furnace repair. The technician was knowledgeable and efficient. Took a day to schedule but they made it work. Good pricing for the quality of service.",
      "createTime": "2024-01-05T09:15:00.000Z",
      "name": "review_014"
    },
    {
      "reviewer": {"displayName": "Nancy Jackson"},
      "starRating": "FIVE",
      "comment": "Best HVAC service in town! Ron is honest, professional, and his pricing is always fair. We've used him for years and he's never let us down. Quick response time too!",
      "createTime": "2024-03-12T15:30:00.000Z",
      "name": "review_015"
    },
    {
      "reviewer": {"displayName": "Paul White"},
      "starRating": "TWO",
      "comment": "Work quality was fine but communication was poor. Had to call multiple times to get updates on our service appointment. Eventually got it done but the process was frustrating.",
      "createTime": "2024-06-05T10:20:00.000Z",
      "name": "review_016"
    },
    {
      "reviewer": {"displayName": "Susan Harris"},
      "starRating": "FIVE",
      "comment": "Ron saved our summer! AC broke during a heat wave and he came out the same day. Professional service, explained everything clearly, and got us cool again fast. Can't thank him enough!",
      "createTime": "2024-08-18T13:00:00.000Z",
      "name": "review_017"
    },
    {
      "reviewer": {"displayName": "Mark Clark"},
      "starRating": "FOUR",
      "comment": "Solid HVAC service. Our heating system repair was done well and the price was fair. Took a few days to schedule during winter rush but understandable. Would use again.",
      "createTime": "2023-12-28T14:45:00.000Z",
      "name": "review_018"
    },
    {
      "reviewer": {"displayName": "Barbara Lewis"},
      "starRating": "FIVE",
      "comment": "Ron has been our HVAC guy for over 15 years. Always dependable, always honest. Recently did our AC tune-up and found a small issue before it became a big problem. That's the kind of service you want!",
      "createTime": "2024-04-22T11:15:00.000Z",
      "name": "review_019"
    },
    {
      "reviewer": {"displayName": "Steven Robinson"},
      "starRating": "FIVE",
      "comment": "Excellent emergency service! Our furnace died at 10pm on a freezing night. Ron answered his phone and had someone out within 2 hours. Above and beyond customer service!",
      "createTime": "2024-01-30T22:30:00.000Z",
      "name": "review_020"
    },
    {
      "reviewer": {"displayName": "Dorothy Walker"},
      "starRating": "FOUR",
      "comment": "Good service on our AC installation. The crew was professional and cleaned up nicely. Only minor issue was some confusion on the scheduling date but they made it right.",
      "createTime": "2024-05-15T16:00:00.000Z",
      "name": "review_021"
    },
    {
      "reviewer": {"displayName": "Kevin Hall"},
      "starRating": "THREE",
      "comment": "The technician did good work on our heating repair but the front office communication needs improvement. Had trouble getting callbacks and scheduling was confusing.",
      "createTime": "2024-02-20T10:45:00.000Z",
      "name": "review_022"
    },
    {
      "reviewer": {"displayName": "Betty Allen"},
      "starRating": "FIVE",
      "comment": "Ron is wonderful! Very professional and his team is excellent. They installed our new HVAC system efficiently and everything works perfectly. Fair pricing and great customer service!",
      "createTime": "2023-10-28T12:30:00.000Z",
      "name": "review_023"
    },
    {
      "reviewer": {"displayName": "Jason Young"},
      "starRating": "FIVE",
      "comment": "Fast, reliable service! Called about our AC not cooling properly and Ron diagnosed and fixed it within hours. Explained everything and the price was very reasonable. Highly recommend!",
      "createTime": "2024-07-08T15:45:00.000Z",
      "name": "review_024"
    },
    {
      "reviewer": {"displayName": "Sandra King"},
      "starRating": "FOUR",
      "comment": "Very pleased with the furnace maintenance service. The technician was thorough and professional. Scheduling took a bit longer than expected but the work quality made up for it.",
      "createTime": "2023-11-15T09:30:00.000Z",
      "name": "review_025"
    },
    {
      "reviewer": {"displayName": "Brian Wright"},
      "starRating": "FIVE",
      "comment": "Outstanding service from start to finish! Ron personally handled our HVAC installation and was very knowledgeable. His team was respectful and efficient. Best contractor we've worked with!",
      "createTime": "2024-03-25T14:15:00.000Z",
      "name": "review_026"
    },
    {
      "reviewer": {"displayName": "Carol Scott"},
      "starRating": "TWO",
      "comment": "The actual repair work was fine but it took over 10 days to get an appointment. When I called for updates, I often got voicemail. Needs better scheduling and communication.",
      "createTime": "2024-05-28T11:00:00.000Z",
      "name": "review_027"
    },
    {
      "reviewer": {"displayName": "Kenneth Green"},
      "starRating": "FIVE",
      "comment": "Ron is the most reliable HVAC contractor I've ever worked with. Quick response, professional service, and honest pricing. Fixed our heating emergency in the middle of winter. Can't recommend him enough!",
      "createTime": "2024-02-05T08:45:00.000Z",
      "name": "review_028"
    },
    {
      "reviewer": {"displayName": "Donna Baker"},
      "starRating": "FOUR",
      "comment": "Great AC repair service. The technician was friendly and explained what was wrong. A bit busy during summer so it took 3 days to get scheduled, but worth the wait for quality work.",
      "createTime": "2024-06-18T13:30:00.000Z",
      "name": "review_029"
    },
    {
      "reviewer": {"displayName": "George Adams"},
      "starRating": "FIVE",
      "comment": "Excellent service! Ron came out for our AC tune-up and found a potential issue before it became expensive. Very thorough, professional, and fair pricing. This is how service should be done!",
      "createTime": "2024-04-10T10:20:00.000Z",
      "name": "review_030"
    },
    {
      "reviewer": {"displayName": "Helen Nelson"},
      "starRating": "FIVE",
      "comment": "We've been using Ron for all our HVAC needs for years. Always prompt, professional, and reliable. Recently had him install a new furnace - great work and very reasonable pricing!",
      "createTime": "2023-10-05T15:00:00.000Z",
      "name": "review_031"
    },
    {
      "reviewer": {"displayName": "Ronald Carter"},
      "starRating": "THREE",
      "comment": "Good technical skills but scheduling was a hassle. Took multiple calls to confirm the appointment time. Once they showed up, the work was done well. Just needs better office management.",
      "createTime": "2024-03-18T09:45:00.000Z",
      "name": "review_032"
    },
    {
      "reviewer": {"displayName": "Michelle Mitchell"},
      "starRating": "FIVE",
      "comment": "Ron is amazing! Our AC broke during a 95 degree day and he had someone out within 3 hours. Professional, efficient, and got us cool again fast. Great pricing too. Will definitely call again!",
      "createTime": "2024-08-25T16:30:00.000Z",
      "name": "review_033"
    },
    {
      "reviewer": {"displayName": "Larry Perez"},
      "starRating": "FOUR",
      "comment": "Very satisfied with our heating system repair. The work was done professionally and the technician was knowledgeable. Took a week to get scheduled but they kept us informed.",
      "createTime": "2024-01-12T11:15:00.000Z",
      "name": "review_034"
    },
    {
      "reviewer": {"displayName": "Sharon Roberts"},
      "starRating": "FIVE",
      "comment": "Best HVAC service we've ever had! Ron is honest, professional, and his response time is incredible. Fixed our emergency heating issue same day. Fair pricing and excellent communication!",
      "createTime": "2024-02-28T14:00:00.000Z",
      "name": "review_035"
    },
    {
      "reviewer": {"displayName": "Gary Turner"},
      "starRating": "FOUR",
      "comment": "Good experience with our AC installation. The crew was professional and the system works great. Scheduling took some back and forth but they got it done. Happy with the end result.",
      "createTime": "2024-06-02T10:30:00.000Z",
      "name": "review_036"
    },
    {
      "reviewer": {"displayName": "Deborah Phillips"},
      "starRating": "FIVE",
      "comment": "Ron has serviced our HVAC system for over a decade. Always reliable, always honest. His maintenance visits are thorough and he's saved us from costly repairs by catching issues early. Highly recommend!",
      "createTime": "2024-03-05T15:45:00.000Z",
      "name": "review_037"
    },
    {
      "reviewer": {"displayName": "Jeffrey Campbell"},
      "starRating": "TWO",
      "comment": "Work quality was decent but communication was terrible. Missed the first appointment with no call, had to reschedule twice. When they finally came the repair was done okay but the experience was frustrating.",
      "createTime": "2024-07-12T09:00:00.000Z",
      "name": "review_038"
    },
    {
      "reviewer": {"displayName": "Lisa Parker"},
      "starRating": "FIVE",
      "comment": "Fantastic service! Our furnace stopped working and Ron came out the same day. He was professional, explained everything clearly, and had us warm again in no time. Fair price and excellent service!",
      "createTime": "2023-12-05T13:20:00.000Z",
      "name": "review_039"
    },
    {
      "reviewer": {"displayName": "Frank Evans"},
      "starRating": "FIVE",
      "comment": "Ron is the only HVAC contractor I trust. Quick response time, professional service, and honest pricing. He's installed two systems for us and maintains them perfectly. Can't say enough good things!",
      "createTime": "2024-04-28T11:00:00.000Z",
      "name": "review_040"
    }
  ]
}
